[{"id": "10.1108/ijesm-08-2020-0015", "title": "Problems of adoption of solar power and subsequent switching behavior: an exploration in India", "abstract": "Purpose The challenges and factors of household adoption and the use of alternative energy sources have been a point of discussion among researchers. The purpose of this study is to apply a variant of the unified theory of adoption and use of technology (i.e. UTAUT 2) to explore the effect of various constructs that influence technology adoption on the consumers’ intention to adopt (and use) solar power generators (SPG) at the household level and the subsequent switching behavior. Design/methodology/approach Based on survey data collected from six cities in India (n = 1,246), factor analysis and structural equation modeling are applied for data analysis and testing the study hypotheses. Findings The results of the structural equation model found UTAUT constructs performance expectancy, effort expectancy, social influence and hedonic to positively affect behavioral intentions to adopt SPG. However, facilitating conditions and perceived value was not found to affect behavioral intentions to adopt SPG. Behavioral intentions to adopt SPG was found to positively influence the switching behavior. Research limitations/implications The present study augments the domain of alternative energy usage behavior by applying the UTAUT 2 in the adoption of alternative energy sources (namely, solar) and subsequent switching behavior from traditional sources at the household level. Practical implications The findings from the present study will guide the marketers and policymakers on the consumer attitudinal and behavioral aspects of solar energy usage at the household level and subsequent switching behavior. Originality/value The present study is novel as it moves beyond household-level behavioral intention to use solar energy and includes the switching behavior to shift to solar power from traditional energy sources.", "cit_venues": ["energies", "ijesm"], "ref_venues": ["energy policy", "ijesm", "ijesm", "organizational behavior and human decision processes", "electric power systems research", "environ dev sustain", "psychol mark", "renewable and sustainable energy reviews", "decision support systems", "energy and environment", "asia pac jnl of mrkting log", "international journal of man machine studies", "management science", "energy policy", "energy policy", "energy", "asia pac jnl of mrkting log", "energy policy", "ijesm", "energy policy", "energy policy", "decision support systems", "decision sciences", "energy for sustainable development", "decision sciences", "ijesm", "energy and buildings", "ijesm", "renewable energy", "renewable energy", "the journal of strategic information systems", "energy policy", "energy policy", "int j consum stud", "prog photovolt res appl", "journal of consumer marketing", "energy policy", "computers in human behavior", "renewable and sustainable energy reviews", "european journal of information systems", "energy policy", "jistem", "energy policy", "energy policy", "energy policy", "asia pac jnl of mrkting log", "applied energy", "energy policy", "decision sciences", "decision sciences", "decision sciences", "management science", "jais", "mis quarterly", "mis quarterly", "ojee", "energy policy", "computers in human behavior", "decision support systems", "renewable and sustainable energy reviews", "mis quarterly"], "pub_venue": "International Journal of Energy Sector Management"}, {"id": "10.1108/ijesm-10-2020-0012", "title": "Modelling oil product prices with due regard to proliferation of alternative fuels and tightening of technical standards", "abstract": "Purpose This paper aims to clarify the relationship between oil product prices and factors describing the most crucial emerging trends in fuel consumption. The work is aimed to test the hypothesis that the proliferation of alternative fuel cars is a significant factor in determining the level of motor fuel prices. The influence of technical standards of oil products on the model parameters is also analysed. Design/methodology/approach The hypothesis testing is carried out on the basis of an econometric analysis of information regarding the North-West European commodity market and the data on the registration of alternative fuel passenger vehicles. Time series are analysed for the presence of a structural shift in the parameters of the model as a result of changes in the requirements of technical regulations for fuel. Findings The results suggest a different nature of the influence of the proliferation of alternative fuel passenger vehicles – it has little effect on diesel prices, whilst the indicators under study have a negative effect on the prices of motor gasoline. The construction of oil product price models has confirmed the impact of tightening the technical requirements for the parameters of dependence equations. Practical implications The obtained results can be used in forecasting price indicators in oil refining for strategic and investment purposes. Originality/value This paper fulfils an identified need to take into account the emerging global trends in fuel consumption to obtain reliable parameters for oil product price modelling.", "cit_venues": [], "ref_venues": ["ijesm", "applied energy", "energy policy", "jois", "energy economics", "economic modelling", "energy policy", "energy economics", "physica a statistical mechanics and its applications", "energy economics", "economic modelling", "j appl econ", "energy policy", "international review of economics and finance", "applied energy", "energy economics", "energy economics", "physica a statistical mechanics and its applications", "ssrn journal"], "pub_venue": "International Journal of Energy Sector Management"}, {"id": "10.1108/hff-11-2020-0705", "title": "Numerical study of entropy generation and forced convection heat transfer of a nanofluid in a channel with different fin cross-sections", "abstract": "Purpose This study aims to numerically investigate the thermal-hydrodynamic performance of silicon oxide/water nanofluid laminar flow in the heat sink miniature channel with different fin cross-sections. The effect of the fin cross-section including semi-circular, rectangular and quadrant in two directions of flat and curved, and channel substrate materials of steel, aluminum, copper and titanium were examined. Finally, the analysis of thermal and frictional entropy generation in different channels is performed. Design/methodology/approach According to the numerical results, the highest heat transfer coefficients belong to the rectangular, quadrant 2, quadrant 1 and semi-circular fins compared to the channel without fin is 38.65%, 29.94%, 27.45% and 17.1%, respectively. Also, the highest performance evaluation criteria belong to the rectangular and quadrant 2 fins, which have 1.35 and 1.29, respectively. Based on the thermal conductivity of the substrate material, the best material is copper. According to the results of entropy analysis, the reduction of thermal irreversibility of the channel with rectangular, quadrant 1, quadrant 2 and semi-circular compared to non-finned channel is equal to 72%, 57%, 63% and 48%, respectively. Findings The rectangular and quadrant 2 fins are the best fins and the copper substrate material is the best material to reduce the entropy generation. Originality/value The silicon oxide/water nanofluid flow in the heat sink miniature channel with various fin shapes and the curvature angle against the fluid flow was simulated to increase the heat transfer performance. The whole test section is simulated in three-dimensional. Different channel materials have been investigated to find the best channel substrate material.", "cit_venues": [], "ref_venues": ["journal of molecular liquids", "international journal of mechanical sciences", "chemometrics and intelligent laboratory systems", "international journal of thermal sciences", "renewable and sustainable energy reviews", "physics of fluids", "journal of molecular liquids", "inventions", "international journal of heat and mass transfer", "superlattices and microstructures", "international communications in heat and mass transfer", "international journal of heat and mass transfer", "applied thermal engineering", "applied thermal engineering", "chemical engineering and processing process intensification", "applied energy", "international communications in heat and mass transfer", "international journal of heat and mass transfer", "heat transfer engineering", "international journal of mechanical sciences", "applied thermal engineering", "j nanopart res", "international journal of heat and mass transfer", "international journal of thermal sciences", "international journal of thermal sciences", "international journal of heat and mass transfer", "international journal of heat and mass transfer", "international journal of heat and mass transfer", "j therm anal calorim", "j therm anal calorim", "international communications in heat and mass transfer", "sustainable energy technologies and assessments", "international communications in heat and mass transfer", "international journal of heat and mass transfer", "applied thermal engineering", "journal of the taiwan institute of chemical engineers", "experimental thermal and fluid science", "experimental thermal and fluid science", "applied thermal engineering", "international communications in heat and mass transfer", "physica a statistical mechanics and its applications", "journal of molecular liquids", "j therm anal calorim", "international journal of thermal sciences", "j therm anal calorim", "journal of molecular liquids", "journal of molecular liquids", "international communications in heat and mass transfer", "international journal of heat and mass transfer", "international journal of heat and mass transfer", "ieee electron device lett", "experimental thermal and fluid science"], "pub_venue": "International Journal of Numerical Methods for Heat & Fluid Flow"}, {"id": "10.1108/hff-01-2021-0062", "title": "Thermosolutal natural convection in a partly porous cavity with sinusoidal wall heating and cooling", "abstract": "Purpose This paper aims to consider numerical analysis of laminar double-diffusive natural convection inside a non-homogeneous closed medium composed of a saturated porous matrix and a clear binary fluid under spatial sinusoidal heating/cooling on one side wall and uniform salting. Design/methodology/approach The domain of interest is a partially square porous enclosure with sinusoidal wall heating and cooling. The fluid flow, heat and mass transfer dimensionless governing equations associated with the corresponding boundary conditions are discretized using the finite volume method. The resulting algebraic equations are solved by an in-house FORTRAN code and the SIMPLE algorithm to handle the non-linear character of conservation equations. The validity of the in-house FORTRAN code is checked by comparing the current results with previously published experimental and numerical works. The effect of the porous layer thickness, the spatial frequency of heating and cooling, the Darcy number, the Rayleigh number and the porous to fluid thermal conductivity ratio is analyzed. Findings The results demonstrate that for high values of the spatial frequency of heating and cooling ( f = 7), temperature contours show periodic variations with positive and negative values providing higher temperature gradient near the thermally active wall. In this case, the temperature variation is mainly in the porous layer, while the temperature of the clear fluid region is practically the same as that imposed on the left vertical wall. This aspect can have a beneficial impact on thermal insulation. Besides, the porous to fluid thermal conductivity ratio, R k , has practically no effect on S h h o t w a l l , contrary to N u i n t e r f a c e where a strong increase is observed as R k is increased from 0.1 to 100, and much heat transfer from the hot wall to the clear fluid via the porous media is obtained. Practical implications The findings are useful for devices working on double-diffusive natural convection inside non-homogenous cavities. Originality/value The authors believe that the presented results are original and have not been published elsewhere.", "cit_venues": [], "ref_venues": ["international journal of heat and mass transfer", "international journal of numerical methods for heat and fluid flow", "j fluid mech", "applied thermal engineering", "j heat transfer", "j fluid mech", "international journal of thermal sciences", "j heat transfer", "international journal of heat and mass transfer", "journal of thermophysics and heat transferpublished online", "international journal of numerical methods for heat and fluid flow", "journal of agricultural engineering research", "numerical heat transfer part a applications", "international journal of heat and mass transfer", "advances in heat transfer", "international journal of numerical methods for heat and fluid flow", "international journal of heat and mass transfer", "energy", "transp porous med", "international journal of mechanical sciences", "international journal of mechanical sciences", "international journal of thermal sciences", "adv appl math mech", "int j numer methods eng", "j fluid mech", "international journal of heat and mass transfer", "international journal of numerical methods for heat and fluid flow", "international journal of numerical methods for heat and fluid flow", "transp porous med", "international journal of numerical methods for heat and fluid flow", "energy conversion and management", "j therm anal calorim", "international journal of heat and mass transfer", "can j chem eng", "numerical heat transfer part a", "int j heat and mass transfer", "international journal of numerical methods for heat and fluid flow", "alexandria engineering journal", "numerical heat transfer part a"], "pub_venue": "International Journal of Numerical Methods for Heat & Fluid Flow"}, {"id": "10.1108/hff-03-2021-0160", "title": "Numerical and experimental analysis of parallel-pass forced convection solar air heating wall with different plenum and absorber configurations", "abstract": "Purpose Over the recent years, solar energy has received outstanding attention from researchers. Solar energy applications and related large-scale projects are increasing to meet growing global energy demand as an economical, non-polluting and renewable energy source. The purpose of this study is investigating different plenum and absorber configurations of solar air heating wall (SAHW) experimentally and numerically. Design/methodology/approach In this study, various configurations of SAHW have been numerically simulated to determine the most effective design. According to the simulation results, two SAHWs with various plenum thicknesses have been fabricated and tested at different conditions. Findings Numerical simulation results indicated that parallel-flow SAHWs exhibited better performance in comparison with other placements of absorber plate. Regarding to the experimentally attained results, the highest thermal efficiency was reached to 80.51%. Also, the average deviation between experimentally and numerically obtained outlet temperature is 5.5%. Originality/value Considering the obtained results in the present study, designed SAHW has admissible efficiency to be used in various industrial and residential applications such as; air preheating, space heating and drying.", "cit_venues": ["hff", "journal of building engineering"], "ref_venues": ["alexandria engineering journal", "renewable energy", "solar energy", "applied thermal engineering", "renewable energy", "journal of cleaner production", "applied thermal engineering", "international communications in heat and mass transfer", "renewable energy", "energy and buildings", "journal of cleaner production", "energy and buildings", "applied thermal engineering", "appl sol energy", "renewable energy", "heat trans res", "international journal of numerical methods for heat and fluid flow", "renewable energy", "journal of cleaner production", "international journal of numerical methods for heat and fluid flow", "solar energy", "solar energy", "solar energy", "international journal of numerical methods for heat and fluid flow", "journal of cleaner production", "renewable energy", "applied energy", "solar energy", "energy", "journal of cleaner production", "solar energy", "energy conversion and management", "renewable energy", "journal of cleaner production", "solar energy", "building and environment", "energy conversion and management", "sustainability", "solar energy", "renewable and sustainable energy reviews", "renewable energy", "case studies in thermal engineering", "renewable energy", "solar energy", "renewable energy", "solar energy", "solar energy", "applied thermal engineering", "solar energy", "renewable energy", "building and environment", "expert systems with applications", "applied thermal engineering", "solar energy", "journal of cleaner production", "renewable energy", "applied thermal engineering", "hff", "science of the total environment", "renew sust energ rev"], "pub_venue": "International Journal of Numerical Methods for Heat & Fluid Flow"}, {"id": "10.1108/hff-03-2021-0169", "title": "Thermo-structural analysis of a honeycomb-type volumetric absorber for concentrated solar power applications", "abstract": "Purpose Volumetric air receivers experience high thermal stress as a consequence of the intense radiation flux they are exposed to when used for heat and/or power generation. This study aims to propose a proper design that is required for the absorber and its holder to ensure efficient heat transfer between the fluid and solid phases and to avoid system failure due to thermal stress. Design/methodology/approach The design and modeling processes are applied to both the absorber and its holder. A multi-channel explicit geometry design and a discrete model is applied to the absorber to investigate the conjugate heat transfer and thermo-mechanical stress levels present in the steady-state condition. The discrete model is used to calibrate the initial state of the continuum model that is then used to investigate the transient operating states representing cloud-passing events. Findings The steady-state results constitute promising findings for operating the system at the desired airflow temperature of 700°C. In addition, we identified regions with high temperatures and high-stress values. Furthermore, the transient state model is capable of capturing the heat transfer and fluid dynamics phenomena, allowing the boundaries to be checked under normal operating conditions. Originality/value Thermal stress analysis of the absorber and the steady/transient-state thermal analysis of the absorber/holder were conducted. Steady-state heat transfer in the explicit model was used to calibrate the initial steady-state of the continuum model.", "cit_venues": [], "ref_venues": ["renewable energy", "renewable energy", "renewable and sustainable energy reviews", "solar energy", "solar energy", "renewable and sustainable energy reviews", "energy conversion and management", "z angew math mech", "journal of the franklin institute", "renewable energy", "international journal of heat and mass transfer", "solar energy", "renewable energy", "solar energy", "int j numer methods eng", "int j numer methods eng", "journal of renewable and sustainable energy", "solar energy", "renewable energy", "energy", "international journal of numerical methods for heat and fluid flow", "solar energy", "solar energy materials and solar cells", "solar energy", "solar energy", "powder metallurgy", "international journal of heat and mass transfer", "international journal of numerical methods for heat and fluid flow", "renew sust energ rev", "hff", "acta mech", "zamm-z angew math me", "j franklin i", "wfs", "can j phys", "applied thermal engineering"], "pub_venue": "International Journal of Numerical Methods for Heat & Fluid Flow"}, {"id": "10.1088/2634-4505/ac3f2a", "title": "A Colorado-specific life cycle assessment model to support evaluation of low-carbon transportation fuels and policy", "abstract": "Abstract The transportation sector accounts for over 20 percent of greenhouse gas (GHG) emissions in Colorado which without intervention will grow to over 30 million metric tons (MMT) of GHG emissions per year. This study seeks to develop a specific characterization of the Colorado fuel and transportation system using a customized life cycle assessment (LCA) model. The model (CO-GT) was developed as an analytical tool to define Colorado’s 2020 baseline life cycle GHG emissions for the transportation sector, and to examine Colorado-specific pathways for GHG reductions through fuel types and volumes changes that might be associated with a state clean fuel standard (CFS). By developing a LCA of transportation fuels that is specific to the state of Colorado’s geography, fleet makeup, policies, energy sector and more, these tools can evaluate various proposals for the transition towards a more sustainable state transportation system. The results of this study include a quantification of the Colorado-specific roles of clean fuels, electricity, extant policies, and fleet transition in projections of the state’s 2030 transportation sector GHG emissions. Relative to a 2020 baseline, electrification of the vehicle fleet is found to reduce state-wide lifecycle GHG emissions by 7.7 MMT CO 2e by 2030, and a model CFS policy able to achieve similar reductions in the carbon intensity of clean fuels as was achieved by California in the first 10 years of its CFS policies is found to only reduce state-wide lifecycle GHG emissions by 0.2 MMT CO 2e by 2030. These results illustrate the insensitivity of Colorado’s transportation fleet GHG emissions reductions to the presence of CFS policies, as proposed to date.", "cit_venues": [], "ref_venues": ["est", "j cleaner prod", "biotechnol biofuels", "transp res d", "environ resour econ", "j cleaner prod", "energy policy", "energy policy", "j ind ecol", "transport pol", "fuel", "energy policy", "energy policy"], "pub_venue": "Environmental Research: Infrastructure and Sustainability"}, {"id": "10.1142/s0217979222500060", "title": "Molecular simulation of energy storage properties of R32, R134A and R1234YF in MOF-5 AND MOF-177", "abstract": "The addition of porous nanomaterials is promising to enhance the thermal energy property of the organic working fluid. In this paper, molecular dynamics (MD) and grand canonical Monte Carlo simulations are employed to investigate the adsorption and energy storage properties of R32, R134a and R1234yf in MOF-5 and MOF-177. The results showed that the working fluid with small molecular size is easier to absorb and desorb in MOF structure. Besides, the MOF with larger specific surface area and pore size can absorb more organic working fluids, which can result in the larger enhancement of energy storage.", "cit_venues": [], "ref_venues": ["renewable and sustainable energy reviews", "energy", "energy conversion and management", "energy conversion and management", "applied energy", "energy conversion and management", null, "nano energy", "chem soc rev", "international journal of heat and mass transfer", "chem soc rev", "journal of cleaner production", "j am chem soc", "gas separation purification", "chem soc rev", "chem soc rev", "international journal of heat and mass transfer", "nature", "energies", null, "int j mod phys b", "int j mod phys b", "int j mod phys b", "j phys chem b", "molecular simulation", "materials", "energy procedia", "international journal of refrigeration", "energy procedia", "international journal of refrigeration", "applied thermal engineering", "physica e low dimensional systems and nanostructures", "fuel", "microporous and mesoporous materials", "science", "the journal of chemical physics", "j phys chem b", "ann phys", "chemical engineering science", "fuel", "journal of molecular liquids", "fuel", "chin sci bull"], "pub_venue": "International Journal of Modern Physics B"}, {"id": "10.1108/acmm-07-2021-2518", "title": "Insitu SVET studies on the current density distribution on dissolving of Mg, MgZn2, Mg2Si and Al4Cu2Mg8Si7 surfaces in NaCl solutions", "abstract": "Purpose This paper aims to acquire the current density distribution on dissolving of Mg, MgZn 2 (η -phase), Mg 2 Si (ß-phase) and Al 4 Cu 2 Mg 8 Si 7 (Q-phase) surface in NaCl solutions. Design/methodology/approach MgZn 2 (η -phase), Mg 2 Si (ß-phase) and Al 4 Cu 2 Mg 8 Si 7 (Q-phase) are important intermetallic compounds found in aluminum alloys. Insitu scanning vibrating electrode technique (SVET) was used to acquire the current density distribution on dissolving of Mg, MgZn 2 (η -phase), Mg 2 Si (ß-phase) and Al 4 Cu 2 Mg 8 Si 7 (Q-phase) surface in NaCl solutions scanning electron microscopy/energy-dispersive X-ray spectroscopy (SEM/EDX) was used to characterize the corroded surface. Findings SVET maps reveal that these compounds display characteristic dissolution features. Mg and MgZn 2 displayed localized anodic and cathodic sites while that of Al 4 Cu 2 Mg 8 Si 7 Mg 2 Si displayed a diffused distribution of anodic and cathodic sites. The magnitude of the integrated anodic current densities on the compounds was noted to decrease with the progress of time, and the order of the magnitude of the current density with respect to the compounds is Mg Mg 2 Si Al 4 Cu 2 Mg 8 Si 7 MgZn 2 . SEM/EDX reveal that the highest mass loss recorded after the SVET test was manifested by Mg 2 Si followed by MgZn 2 then Al 4 Cu 2 Mg 8 Si 7 . Originality/value Auxiliary information on the current density distribution on the corroding sample surface at the microscopic scale has been provided by SVET thereby taking care of certain limitations of traditional corrosion monitoring techniques such as gravimetric, hydrogen evolution and electrochemical measurements.", "cit_venues": [], "ref_venues": ["corrosion science", "adv eng mater", "j electrochem soc", "corrosion science", "j electrochem soc", "corrosion science", "j electrochem soc", "applied surface science", "journal of materials science technology", "j electrochem soc", "j solid state electrochem", "corrosion science", "electrochimica acta", "j electrochem soc", "j electrochem soc", "corrosion science", "j mater sci", "j electrochem soc", "corrosion science", "corrosion science", "corrosion science", "electrochemistry communications", "surf interface anal"], "pub_venue": "Anti-Corrosion Methods and Materials"}, {"id": "10.1115/1.4053055", "title": "Effect of Series and Parallel Combination of Photovoltaic Thermal Collectors on the Performances of Integrated Active Solar Still", "abstract": "Abstract In this article, an analytical expression for hourly yield, electrical energy and overall exergy of self-sustained solar still integrated with series and parallel combination of photovoltaic thermal-compound parabolic concentrator (PVT-CPC) collectors have been derived. The analysis is based on the basic energy balance equation of the proposed active solar distillation system. Based on numerical computations, it has been observed that the yield is maximum for all self-sustained PVT-CPC collectors are connected in series (case (i)). Furthermore, the daily yield and exergy increase with the increase of water depth unlike passive solar still for all collectors connected in series. However, overall exergy decreases with an increase of water depth for all collectors connected in parallel (case (iv)). For numerical simulations, the total numbers of self-sustained PVT-CPC collectors has been considered as constant. Furthermore, an effect of series and parallel combination of PVT-CPC collectors on daily yield, electrical energy, and overall exergy has also been carried out. Following additional conclusions have also been drawn: (i) The daily yield of the proposed active solar still decreases with the increase of packing factor of semi-transparent photovoltaic (PV) module for a given water depth and electrical energy and overall exergy increase with water depth for case (i) as expected due to low operating temperature range at higher water depth in the basin. (ii) The daily yield, electrical energy, and overall exergy increase with the increase of water depth for all combination of series and parallel arrangement of PVT-CPC collectors for a packing factor of 0.22 as per our expectation.", "cit_venues": [], "ref_venues": ["rev", "asme j therm sci eng appl", "asme j therm sci eng appl", "prog energy combust sci", "renewable energy", "desalination", "jksues", "sol energy", "j energy storage", "energy convers manage", "sol energy", "renewable energy", "desalination", "desalination", "desalin water treat", "renewable energy", "renewable energy", "desalination", "j cleaner prod", "groundw sustain dev", "asme j therm sci eng appl", "sol energy", "renewable sustainable energy rev", "sol energy", "rev", null, null], "pub_venue": "Journal of Thermal Science and Engineering Applications"}, {"id": "10.1108/compel-06-2021-0198", "title": "Congestion management in deregulated power system using adaptive moth swarm optimization", "abstract": "Purpose The purpose of this paper is to enhance the line congestion and to minimize power loss. Transmission line congestion is considered the most acute trouble during the operation of the power system. Therefore, congestion management acts as an effective tool in using the available power without breaking the system hindrances or limitations. Design/methodology/approach Over the past few years, determining the optimal location and size of the devices have pinched a great deal of consideration. Numerous approaches have been established to mitigate the congestion rate, and this paper aims to enhance the line congestion and minimize power loss by determining the compensation rate and optimal location of a thyristor-switched capacitor (TCSC) using adaptive moth swarm optimization (AMSO) algorithm. Findings An AMSO algorithm uses the performances of moth flame and the chaotic local search-based shrinking scheme of the bacterial foraging optimization algorithm. The proposed AMSO approach is executed and discussed for the IEEE-30 bus system for determining the optimal location of single TCSC and dual TCSC. Originality/value In addition to this, the proposed algorithm is compared with various other existing approaches, and the results thus obtained provide better performances than other techniques.", "cit_venues": [], "ref_venues": ["ain shams engineering journal", "ieee access", "applied soft computing", "wireless pers commun", "elsevier", "international journal of ambient energy", "elsevier", "j inst eng india ser b", "ijra", "electric power systems research", "sustainability", "energies", "sustainability", "ijece", "renewable and sustainable energy reviews", "ijies", "multimed tools appl", "prog photovolt res appl", "elsevier", "ieee region conference", "icecds"], "pub_venue": "COMPEL - The international journal for computation and mathematics in electrical and electronic engineering"}, {"id": "10.1115/1.4053119", "title": "Numerical Analysis of Heat-Pipe-Based Battery Thermal Management System for Prismatic Lithium-Ion Batteries", "abstract": "Abstract An effective battery thermal management system (BTMS) is essential for controlling both the maximum temperature and the temperature uniformity of a battery module. In this study, a novel and lightweight BTMS for prismatic batteries based on a heat pipe is proposed. A numerical model is created to study the influence of heat-transfer designs and other factors on the thermal performance of the BTMS, and the simulation results are checked experimentally. The results show that when the condensation section of the heat pipe is cooled by liquid, the maximum temperature of the battery (Tmax) is reduced by 18.1% compared with air cooling. Decreasing the coolant temperature can reduce Tmax, but can also lead to an undesirable temperature nonuniformity. The Tmax and the maximum temperature difference (ΔTmax) in a battery module both increase rapidly as the discharge rate rises. The Tmax and ΔTmax are lower than 40 °C and 5 °C, respectively, when the discharge rate of the battery is lower than 2 °C. Under preheating conditions in cold weather, increasing the temperature of the heating medium can improve the temperature of the batteries, but at the same time it can make the battery module's temperature more nonuniform, and also add to cost. The temperature of the heating medium should therefore be selected with care. It could be concluded that the above results can provide perspectives in designing and optimizing battery thermal management systems.", "cit_venues": [], "ref_venues": ["j power sources", "appl therm eng", "appl therm eng", "appl energy", "j energy eng", "int j heat mass transfer", "int j heat mass transfer", "j energy storage", "appl therm eng", "appl therm eng", "appl therm eng", "ijhe", "case stud therm eng", "j power sources", "energy", "appl therm eng", "energy", "j energy storage", "j energy storage", "j energy storage", "appl therm eng", "appl therm eng", "appl therm eng", "appl therm eng", "jes", "int j energy res", "int j energy res", "appl therm eng", "energy", "asme j heat transfer trans asme", "energy convers manage", "appl energy", "scut"], "pub_venue": "Journal of Thermal Science and Engineering Applications"}, {"id": "10.1115/1.4053120", "title": "Active Cooling System for Downhole Electronics in High-Temperature Environments", "abstract": "Abstract Downhole high-temperature environment is an important factor affecting the performance of downhole electronic system. At present, various active cooling technologies and passive cooling technologies have been proposed to reduce the temperature of downhole electric circuit system. However, passive cooling technologies can only provide limited cooling capacity for drilling tools under high-temperature environment, and the duration of cooling is short, which cannot meet the long-time drilling task. This paper presents an active cooling system (ACS) for downhole electronics and the effects of different temperatures on the performance of electronic components are analyzed. The ACS mainly includes a micro supercharger, condenser tube, evaporation pipe, capillary tube, and refrigerant. The theoretical analysis of heat transfer and refrigerant capacity in high-temperature environment is carried out. The thermal characteristics of the ACS are evaluated experimentally. The results show that the temperature of electronic components can be reduced to below 163 °C in the 200 °C downhole environment and components. The geomagnetic field data measured by electronic components at room temperature, 200 °C and with ACS are compared. The results show that ACS can keep electronic components working normally.", "cit_venues": [], "ref_venues": ["appl therm eng", "sensors", "ees", "rev", "energy", "tie", "asme j electron packag", "renewable energy", "renewable energy", "heat transfer eng", "appl therm eng", "appl therm eng", "renewable energy", "renewable energy", "renewable energy", "renewable energy", "int j therm sci", "energy", "appl energy", "int j refrig"], "pub_venue": "Journal of Thermal Science and Engineering Applications"}, {"id": "10.1115/1.4053103", "title": "A Method of Stall and Surge Prediction in Axial Compressors Based on Three-Dimensional Body-Force Model", "abstract": "Abstract The occurrence of stall and surge in axial compressors has a great impact on the performance and reliability of aero-engines. Accurate and efficient prediction of the key features during these events has long been the focus of engine design processes. In this paper, a new body-force model that can capture the three-dimensional and unsteady features of stall and surge in compressors at a fraction of time required for URANS computations is proposed. To predict the rotating stall characteristics, the deviation of local airflow angle from the blade surface is calculated locally during the simulation. According to this local deviation, the computational domain is divided into stalled and forward flow regions, and the body-force field is updated accordingly; to predict the surge characteristics, the local airflow direction is used to divide the computational domain into reverse flow regions and forward flow regions. A single-stage axial compressor and a three-stage axial compressor are used to verify the proposed model. The results show that the method is capable of capturing stall and surge characteristics correctly. Compared to the traditional fully three-dimensional URANS method (fRANS), the simulation time for multistage axial compressors is reduced by 1–2 orders of magnitude.", "cit_venues": [], "ref_venues": ["asme j eng gas turbines power", "asme j eng gas turbines power", "asme j turbomach", "asme j turbomach", "j propul power", "proc inst mech eng", "j propul power", "asme j turbomach", "asme j eng gas turbines power", "comput phys", "aerosp sci technol", "asme j eng gas turbines power", "aiaa j", "j propul power", "asme j turbomach", "asme j turbomach", "j propul power"], "pub_venue": "Journal of Engineering for Gas Turbines and Power"}, {"id": "10.1108/compel-04-2021-0150", "title": "A combined effective time series model based on clustering and whale optimization algorithm for forecasting smart meters electricity consumption", "abstract": "Purpose The current challenge for forecasting smart meters electricity consumption lies in the uncertainty and volatility of load profiles. Moreover, forecasting the electricity consumption for all the meters requires an enormous amount of time. Most papers tend to avoid such complexity by forecasting the electricity consumption at an aggregated level. This paper aims to forecast the electricity consumption for all smart meters at an individual level. This paper, for the first time, takes into account the computational time for training and forecasting the electricity consumption of all the meters. Design/methodology/approach A novel hybrid autoregressive-statistical equations idea model with the help of clustering and whale optimization algorithm (ARSEI-WOA) is proposed in this paper to forecast the electricity consumption of all the meters with best performance in terms of computational time and prediction accuracy. Findings The proposed model was tested using realistic Irish smart meters energy data and its performance was compared with nine regression methods including: autoregressive integrated moving average, partial least squares regression, conditional inference tree, M5 rule-based model, k-nearest neighbor, multilayer perceptron, RandomForest, RPART and support vector regression. Results have proved that ARSEI-WOA is an efficient model that is able to achieve an accurate prediction with low computational time. Originality/value This paper presents a new hybrid ARSEI model to perform smart meters load forecasting at an individual level instead of an aggregated one. With the help of clustering technique, similar meters are grouped into a few clusters from which reduce the computational time of the training and forecasting process. In addition, WOA improves the prediction accuracy of each meter by finding an optimal factor between the average electricity consumption values of each cluster and the electricity consumption values for each one of its meters.", "cit_venues": [], "ref_venues": ["international journal of forecasting", "biometrika", "electric power systems research", "ieee trans smart grid", "electric power systems research", "ieee commun surv tut", "applied energy", "strat mgmt j", "korean j anesthesiol", "j intell inf syst", "advances in engineering software", "ijet", "journal of computational and applied mathematics", "energy procedia", "journal of the royal statistical society series b", "ieee trans smart grid", "renewable and sustainable energy reviews", null, "big data"], "pub_venue": "COMPEL - The international journal for computation and mathematics in electrical and electronic engineering"}, {"id": "10.1680/jener.21.00056", "title": "The UK industrial decarbonisation strategy revisited", "abstract": "Since 2010, successive UK governments have produced various strategies for industry to reduce carbon dioxide emissions (‘decarbonise’). This paper scrutinises the most recent version that was published in March 2021: the Industrial Decarbonisation Strategy (IDS). It contrasts the policy content of the IDS with previous industrial roadmaps, action plans and strategies (including the Clean Growth Strategy of 2017). In addition, it compares the proposals in the IDS with the latest recommendations of the UK government's independent Climate Change Committee, as well as drawing on lessons learned from the techno-economic assessments published by the author and his collaborators for a number of key ‘foundation industries’. The latter emit significant shares of UK industrial carbon dioxide (CO 2 ) emissions: the iron and steel (∼25%), chemicals (∼19%), cement (∼8%), pulp and paper (∼6%) and glass (∼3%) sectors. They also produce about 28 Mt of materials per year, which are worth £52 billion to the UK economy, and account for ∼10% of UK total carbon dioxide emissions.", "cit_venues": [], "ref_venues": ["fuel cell bulletin", "fuel cell bulletin", "climatic change", "applied thermal engineering", "journal of cleaner production", "proceedings of the institution of mechanical engineers part a journal of power and energy", "journal of cleaner production", "proceedings of the institution of civil engineers energy", "energy policy", "proceedings of the institution of civil engineers energy", "applied energy", "global transitions", "proceedings of the institution of civil engineers energy", "wires energy environ", "applied energy", "applied thermal engineering", "advances in applied energy", "interdisciplinary science reviews", "proceedings of the institution of civil engineers energy", "proceedings of the institution of civil engineers energy", "proceedings of the institution of civil engineers energy", "energy sci eng", "proceedings of the institution of civil engineers civil engineering", "international journal of greenhouse gas control", "temperature", "climate policy", "renewable and sustainable energy reviews"], "pub_venue": "Proceedings of the Institution of Civil Engineers - Energy"}, {"id": "10.1115/1.4053171", "title": "Performance Analysis of Channels in Adiabatic and Non-Adiabatic Spiral Plate Heat Exchangers: A Thermodynamic Study", "abstract": "Abstract This paper presents a systematic analysis of the thermodynamic performance of spiral turns in spiral plate heat exchangers (SPHEs), including non-adiabatic sources such as effects of heat leakage to the environment and fluid friction. These sources can reduce the thermal performance and increase the irreversibility of SPHEs. First, the critical factors of the heat loss rate to the environment, internal heat transfer rate (HTR), and channel temperature distributions are specified based on modeling the SPHE with hypothetical heat exchanger networks. Also, this modeling is validated with the results of channel temperature distributions by computational fluid dynamics simulation. Second, besides examining the spiral turns by entropy generation methods, entransy-based parameters are developed to analyze the SPHEs based on generated heat due to fluid viscosity in their channels for the first time. Finally, to show the method applicability proposed, an optimal designed single-phase counter-current SPHE is explored as a case. Three scenarios are introduced to evaluate the performance and irreversibility, namely heat leakage and no heat leakage to the environment and transferring the net heat between the streams. Results highlight the effects of non-adiabatic conditions, such as reductions of around 5.46%, 2.25%, and 2.42%, respectively, in the heat transfer area, total HTR, and overall heat transfer coefficient. Furthermore, findings confirm the performance reductions and irreversibility increments in non-adiabatic conditions and assert the importance of covering the outermost channels appropriately.", "cit_venues": [], "ref_venues": ["math meth appl sci", "j therm anal calorim", "therm sci", "int j photoenergy", "int j photoenergy", "asme j heat transfer trans asme", "chem eng technol", "food bioprod process", "heat transfer eng", "process integr optim sustain", "cep", "int j heat mass transfer", "asme j heat transfer trans asme", "appl therm eng", "mas", "asme j heat transfer trans asme", "int j heat mass transfer", "asme j heat transfer trans asme", "asme j heat transfer trans asme", "energy", "ger", "adv powder technol", "therm sci", "cep", "int j heat mass transfer", "in chinese", "in chinese", "int j heat mass transfer", "int j heat mass transfer", "sci china technol sci", "int commun heat mass transfer", "int j heat mass transfer", "int j refrig", "heat transfer", null], "pub_venue": "Journal of Thermal Science and Engineering Applications"}, {"id": "10.1115/1.4053167", "title": "Sensitivity Analysis of the Levelized Cost of Electricity for a Particle-Based Concentrating Solar Power System", "abstract": "Abstract This study presents a sensitivity analysis of the levelized cost of electricity (LCOE) for a particle-based system with the costs of the most current components. New models for the primary heat exchanger, thermal energy storage, and tower are presented and used to establish lower and upper bounds for these three components. The rest of component costs such as particle cost, cavity cost, and lift cost are set to lower and upper bounds estimating an uncertainty between 25% and 50%. Other relevant parameters related to lift and storage performance are also included in the analysis with the same uncertainty. This study also includes an upgrade to the receiver model by including the wind effect in the efficiency, which was not included in previous publications and may have a big impact in the system design. A parametric analysis shows the optimum values of solar multiple, storage hours, tower height, and concentration ratio, and a probabilistic analysis provides a cumulative distribution function for a range of LCOE values. The results show that the LCOE could be below $0.06/kWh with a probability of between 80% and 90%, where the costs of primary heat exchanger, particles, and lifts have largest contribution to the variance of the LCOE.", "cit_venues": [], "ref_venues": ["asme j sol energy eng", "asme j sol energy eng", "asme j sol energy eng", "asme j sol energy eng", "entropy", "sol energy", "sol energy", "appl energy", "appl therm eng", "sol energy", null, null, "asme international conference on energy sustainability", "j eng gas turbines power", "solarpaces international conference on concentrating solar power and chemical energy systems", "proposed for presentation at the solarpaces held in albuquerque nm us", "oil and gas applications supercritical co power cycles wind energy", null, "biofuels hydrogen syngas and alternate fuels chp and hybrid power and energy systems concentrating solar power energy storage environmental economic and policy considerations of advanced energy systems geothermal ocean and emerging energy technologies photovoltaics solar chemistry sustainable building energy systems sustainable infrastructure and transportation thermodynamic analysis of energy systems wind energy systems and technologies"], "pub_venue": "Journal of Solar Energy Engineering"}, {"id": "10.1115/1.4053169", "title": "A Simplified Numerical Approach to Characterize the Thermal Response of a Moving Bed Solar Reactor", "abstract": "Abstract Concentrated solar thermochemical storage in the form of a zero-emission fuel is a promising option to produce long-duration energy storage. Solar fuel is produced using a cavity reactor that captures concentrated solar radiation from a solar field of heliostats. In this paper, heat transfer model of a tubular plug-flow reactor designed and manufactured for a solar fuel production is presented. Experimental data collected from a fixed bed tubular reactor testing are used for model comparison. The system consists of an externally heated tube with counter-current flowing gas and moving solid particles as the heated media. The proposed model simulates the dynamic behavior of temperature profiles of the tube wall, gas, and particles under various gas flowrates and residence times. The heat transfer between gas–wall, solid particle–wall, and gas–solid particle is numerically studied. The model results are compared with the results of experiments done using a 4 kW furnace with a 150 mm heating zone surrounding a horizontal alumina tube (reactor) with 50.8 mm outer diameter and thickness of 3.175 mm. Solid fixed particles of magnesium manganese oxide (MgMn2O4) with the size of 1 mm are packed within the length of 250 mm at the center of the tube length. Simulation results are assessed with respect to fixed bed experimental data for four different gas flowrates, namely, 5, 10, 15, and 20 standard liters per minute of air, and furnace temperatures in the range of 200–1200 °C. The simulation results showed good agreement with maximum steady state error that is less than 6% of those obtained from the experiments for all runs. The proposed model can be implemented as a low-order physical model for the control of temperature inside plug-flow reactors for thermochemical energy storage applications.", "cit_venues": [], "ref_venues": ["wiley interdiscipl rev energy environ", "energy environ sci", "sol energy", "renew sust energ rev", "sol energy mater sol cells", "j environ manage", "renew sust energ rev", "chem eng j", "solid state ionics", "sol energy", "sol energy", "j energy storage", "chem eng sci", "int j heat mass transfer", "powder technol", "part sci technol", "int j heat mass transfer", "thermochim acta", "asme j heat transfer trans asme", null], "pub_venue": "Journal of Thermal Science and Engineering Applications"}, {"id": "10.1108/hff-12-2018-0744", "title": "Temperature distribution analysis in a fully wet moving radial porous fin by finite element method", "abstract": "Purpose This paper aims to study the temperature performance with natural convection and radiation effect on a porous fin in fully wet condition. Design/methodology/approach The finite element method (FEM) is applied to generate numerical solution of the obtained non-dimensional ordinary differential equation containing highly nonlinear terms. The parameters which impact on the heat transfer of fin have been scrutinized by means of plotted graphs. Findings The porous fin is taken for the analysis in radial profile moving with constant velocity. Here, the thermal conductivity is considered to be temperature dependent. The Darcy’s model has been implemented to study the heat transfer analysis. Originality/value The paper is genuine in its type, and there are hardly any works on fins as per the authors’ knowledge.", "cit_venues": ["applied thermal engineering", "phys scr", "math sci", "hff", "j therm anal calorim", "commun theor phys", "computer methods and programs in biomedicine", "proceedings of the institution of mechanical engineers part n journal of nanomaterials nanoengineering and nanosystems"], "ref_venues": ["communications in nonlinear science and numerical simulation", "journal of the franklin institute", "int j thermophys", "energy conversion and management", "therm sci", "international journal of numerical methods for heat and fluid flow", "propulsion and power research", "applied thermal engineering", "international journal of refrigeration", "energy conversion and management", "energy", "international journal of thermal sciences", "arab j sci eng", "int j thermophys", "chinese journal of engineering", "international journal of refrigeration", "international journal of heat and mass transfer", "case studies in thermal engineering", "int j refrig", "hff", "international journal of applied mechanics and engineering", "j franklin i"], "pub_venue": "International Journal of Numerical Methods for Heat & Fluid Flow"}]